# HIRING PREDICTION

## PROBLEM STATEMENT

Given the data, we are to bulid a machine learning model that will predict the salary of an interviewee depending on their experience, interview score and test score.

### Importing libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [2]:
# Reading csv file
hire_df = pd.read_csv(r'C:\Users\QUINCY\Downloads\hiring.csv')

In [3]:
# Loading our dataset
hire_df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
# renaming column (uniformity)
hire_df.rename(columns={'test_score(out of 10)':'test_score','interview_score(out of 10)':'interview_score'},inplace = True)

In [5]:
# dealing with null values (Experience column)
hire_df.experience.fillna('zero',inplace = True)

In [6]:
hire_df

  experience  test_score  interview_score  salary($)
0       zero         8.0                9      50000
1       zero         8.0                6      45000
2       five         6.0                7      60000
3        two        10.0               10      65000
4      seven         9.0                6      70000
5      three         7.0               10      62000
6        ten         NaN                7      72000
7     eleven         7.0                8      80000

In [7]:
# dealing with null values (test score column)
hire_df.fillna(hire_df.mean(),inplace = True)

In [8]:
hire_df

  experience  test_score  interview_score  salary($)
0       zero    8.000000                9      50000
1       zero    8.000000                6      45000
2       five    6.000000                7      60000
3        two   10.000000               10      65000
4      seven    9.000000                6      70000
5      three    7.000000               10      62000
6        ten    7.857143                7      72000
7     eleven    7.000000                8      80000

In [9]:
# Convert column experience to integers

from word2number import w2n

hire_df.experience = hire_df.experience.apply(w2n.word_to_num)
hire_df

   experience  test_score  interview_score  salary($)
0           0    8.000000                9      50000
1           0    8.000000                6      45000
2           5    6.000000                7      60000
3           2   10.000000               10      65000
4           7    9.000000                6      70000
5           3    7.000000               10      62000
6          10    7.857143                7      72000
7          11    7.000000                8      80000

In [10]:
# Our independent variables
i = hire_df.drop('salary($)',axis='columns')
i

   experience  test_score  interview_score
0           0    8.000000                9
1           0    8.000000                6
2           5    6.000000                7
3           2   10.000000               10
4           7    9.000000                6
5           3    7.000000               10
6          10    7.857143                7
7          11    7.000000                8

In [12]:
# Our dependent variable
d = hire_df['salary($)']
d

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [13]:
# Creating a linear regression object
reg = linear_model.LinearRegression()
reg.fit(i,d)

LinearRegression()

In [14]:
# Predicting candidate with 2 years experience, test score 9, interview score 6
reg.predict([[2,9,6]])

array([53290.89255945])

In [15]:
# Predicting candidate with 12 years experience, test score 10, interview score 10
reg.predict([[12,10,10]])

array([92268.07227784])

In [16]:
print('coefficient:',reg.coef_)
print('intercept:',reg.intercept_)

coefficient: [2827.63404314 1912.93803053 2196.9753141 ]
intercept: 17237.3303137272